import { name } from "file-loader";

export function cityVue() {
  Vue.component("blue-part", {
    template: "#blue-part",
    data: () => ({
      places: [
        {
          city: "Москва",
          adress: "Самовывоз: г. Москва, ул. 2-я Союза Молодежи,д 31, офис 357",
        },
        {
          city: "Санкт-Питербург",
          adress:
            "Самовывоз: г. Санкт-Питербург, ул. 2-я Союза Молодежи,д 31, офис 357",
        },
        {
          city: "Новосибирск",
          adress:
            "Самовывоз: г. Новосибирск, ул. 2-я Союза Молодежи,д 31, офис 357",
        },
        {
          city: "Екатеринбург",
          adress:
            "Самовывоз: г. Екатеринбург, ул. 2-я Союза Молодежи,д 31, офис 357",
        },
        {
          city: "Омск",
          adress: "Самовывоз: г. Омск, ул. 2-я Союза Молодежи,д 31, офис 357",
        },
        {
          city: "Ярославль",
          adress:
            "Самовывоз: г. Ярославль, ул. 2-я Союза Молодежи,д 31, офис 357",
        },
      ],
      chosenPlace: {
        city: "Новосибирск",
        adress:
          "Самовывоз: г. Новосибирск, ул. 2-я Союза Молодежи,д 31, офис 357",
      },
    }),
  });
  Vue.component("city", {
    // name: "city",
    template: "#component-city",
    props: ["places", "chosenPlace"],
    data: () => ({}),
  });
  Vue.component("adress", {
    // name: "adress",
    template: "#component-adress",
    props: ["chosenPlace"],
    data: () => ({}),
  });

  new Vue({
    el: "#header",
    data: () => ({
      places: [
        {
          city: "Москва",
          adress: "Самовывоз: г. Москва, ул. 2-я Союза Молодежи,д 31, офис 357",
        },
        {
          city: "Санкт-Питербург",
          adress:
            "Самовывоз: г. Санкт-Питербург, ул. 2-я Союза Молодежи,д 31, офис 357",
        },
        {
          city: "Новосибирск",
          adress:
            "Самовывоз: г. Новосибирск, ул. 2-я Союза Молодежи,д 31, офис 357",
        },
        {
          city: "Екатеринбург",
          adress:
            "Самовывоз: г. Екатеринбург, ул. 2-я Союза Молодежи,д 31, офис 357",
        },
        {
          city: "Омск",
          adress: "Самовывоз: г. Омск, ул. 2-я Союза Молодежи,д 31, офис 357",
        },
        {
          city: "Ярославль",
          adress:
            "Самовывоз: г. Ярославль, ул. 2-я Союза Молодежи,д 31, офис 357",
        },
      ],
      chosenPlace: {
        city: "Новосибирск",
        adress:
          "Самовывоз: г. Новосибирск, ул. 2-я Союза Молодежи,д 31, офис 357",
      },
    }),
    methods: {
      changePlace(place) {
        this.chosenPlace = place;
      },
    },
    mounted() {
      console.log("Component city mounted");
    },
  });
}
